<center><img src="https://github.com/insaid2018/Term-1/blob/master/Images/INSAID_Full%20Logo.png?raw=true" width="240" height="100" /></center>

# <center><b>Introduction to Data Manipulation with Pandas<b></center>

In [ ]:
'''
1. Intro to DS
2. Basics of Python - glue 
3. Stats - desc and inf
4. NumPy np
'''

---
# **Table of Contents**
---

**1.** [**Introduction to Pandas**](#Section1)<br>
**2.** [**Installing & Importing Libraries**](#Section2)<br>
  - **2.1** [**Installing Libraries**](#Section21)
  - **2.2** [**Importing Libraries**](#Section22)

**3.** [**Pandas Series & Indexing**](#Section3)<br>
**4.** [**Pandas DataFrames**](#Section4)<br>
  - **4.1** [**DataFrame Creation**](#Section41)
  - **4.2** [**Loading Files into DataFrame**](#Section42)
  - **4.3** [**DataFrame Attributes**](#Section43)
  - **4.4** [**Access, Add & Drop Operations**](#Section44)
  - **4.5** [**DataFrame Indexing**](#Section45)
  - **4.6** [**Append, Concat & Merge Operations**](#Section46)
  - **4.7** [**Data Filteration**](#Section47)
  - **4.8** [**Multi-Indexed DataFrames**](#Section48)
  - **4.9** [**Groupby in Pandas**](#Section49)
  - **4.10** [**DataFrame Operations**](#Section410)
  - **4.11** [**Time Series Operations**](#Section411)

**5.** [**Conclusion**](#Section5)<br>

In [ ]:
#Recap Numpy:

'''
Numetical Analysis
np.array
shape, ndim, dtype
initialization - zeros, ones, arange, eye, linspace
random - no.random.rand [0,1] or randn N(0,1)
indexing 0,1,2,3...
slicing
broadcasting
conditional selection
Merginf and spliting
np operations - min, max, argmin, argmax, sqrt, mean, exp, log....
'''

---
<a name = Section1></a>
# **1. Introduction to Pandas**
---

- Pandas is a **software library** written for the Python programming language for **data manipulation and analysis**. 

- The library is **highly optimized** for performance, with critical code paths **written in Cython or C**.

- In particular, it **offers data structures** and **operations** for manipulating numerical tables and time series.

- The name is derived from the term "**panel data**", an econometrics term for data sets.

- More specifically datasets that include observations over multiple time periods for the same individuals.

<center><img src="https://upload.wikimedia.org/wikipedia/commons/e/ed/Pandas_logo.svg"></center>

**Library Features:**

- DataFrame object for data manipulation with **integrated indexing**.

- Tools for reading and writing data between **in-memory data structures** and **different file formats**.

- **Data alignment** and integrated handling of missing data.

- **Reshaping, merging, joining, filtration** and **pivoting** of data sets.

- **Label-based slicing, fancy indexing**, and subsetting of large data sets.

- Data structure column **insertion** and **deletion**.

- **Group by** engine allowing split-apply-combine operations on data sets.

- **Hierarchical axis indexing** to work with high-dimensional data in a lower-dimensional data structure.

- **Time series-functionalities** such as: 

  - Date range generation and frequency conversion, 

  - Moving window statistics, moving window linear regressions, date shifting and lagging.

In [1]:
'''
what do you do in excel?

get the data, also use some delimiter |, <tab> <space>
mat calculation
table
graphs - viz
pivot table - 
sort
Filter
stats - summarize the data with stats
vlookup
'''

'\nwhat do you do in excel?\n\nmat calculation\n\n'

---
<a name = Section2></a>
# **2. Installing & Importing Libraries**
---

- To refer to the official documentation of Pandas click <a href="https://pandas.pydata.org/docs/">**here**</a>.

<a name = Section21></a>
### **2.1 Installing Libraries**

In [ ]:
!pip install -q --user pandas

<a name = Section22></a>
### **2.2 Importing Libraries**

- We can give an alias name of pd, so that we dont have to repeatedly use the longer form of the name.

In [41]:
import pandas as pd                                                 # For Panel data analysis
import numpy as np                                                  # Importing package numpys (For Numerical Python)
import seaborn as sns                                               # Visualization package, but we'll be using for data only

---
<a name = Section3></a>
# **3. Pandas Series & Indexing**
---

- Pandas series is a **one-dimensional ndarray** capable of storing any type of data with **axis labels** (including time series).

- The axis labels are called index and they need not be unique but must be **hashable** type.

- An object is hashable if it has a hash **value** that **never changes** during its **lifetime**.

- All of Pythonâ€™s **immutable built-in objects are hashable**, while no mutable containers (such as lists or dictionaries) are.

- We will also observe how the elements of the series are indexed and how we can access any element in a series.

In [42]:
# Creating a list called countries
countries = ['India','France','England']

# Creating a list called capitals
capitals = ['New Delhi','Paris','London']

# Creating 1-D array using capitals list
arr = np.array(capitals)

In [43]:
arr

array(['New Delhi', 'Paris', 'London'], dtype='<U9')

In [44]:
# Creating pandas series using python list
pd.Series(data=capitals)

0    New Delhi
1        Paris
2       London
dtype: object

In [45]:
# Creating pandas series using numpy array
pd.Series(arr)

0    New Delhi
1        Paris
2       London
dtype: object

In [46]:
# Creating a dictionary with index as alphabets and values as numerics
dicts = {'a':10, 'b':20, 'c':30, 'd':40, 'e':50, 'f':60, 'g':70, 'h':80}

# Creating pandas series using dictionary
pd.Series(data=dicts)

a    10
b    20
c    30
d    40
e    50
f    60
g    70
h    80
dtype: int64

In [47]:
2+2

4

In [48]:
# Creating a custom pandas series using capitals and countries
pd.Series(capitals, countries)

India      New Delhi
France         Paris
England       London
dtype: object

In [49]:
population = [1.3, .2, .25]
popu_series = pd.Series(population, countries)

In [50]:
popu_series['India']+popu_series['England']

1.55

In [51]:
popu_series[0]

1.3

**Observation:**

- Pandas series can be created using various inputs.

- Through the above examples, we learned how to create pandas series using a list, array, and dictionary.

**Series Indexing:** Now we will observe how indexing works in case of pandas series.

In [52]:
# Creating a dictionary with index as alphabets and values as numerics
dicts = {'a':10, 'b':20, 'c':30, 'd':40, 'e':50, 'f':60, 'g':70, 'h':80}

# Creating pandas series using dictionary
my_series = pd.Series(data=dicts)

# Output the series
my_series

a    10
b    20
c    30
d    40
e    50
f    60
g    70
h    80
dtype: int64

In [53]:
# Accessing first element present in the series
# Or my_series['a']
my_series['e']

50

**Note:** Even though you pass explicit indexes to the series while creating a series, the implicit indexing is still valid.

In [54]:
# Accessing first three elements present in the series
my_series[:3]

a    10
b    20
c    30
dtype: int64

In [55]:
# Accessing elements ranging from 3 to 7
my_series[3:7]

d    40
e    50
f    60
g    70
dtype: int64

In [56]:
# Accessing elements using label indexes a, b, and c
my_series[['a', 'b', 'c']]

a    10
b    20
c    30
dtype: int64

In [57]:
# Accessing elements ranging from label a index to label c index
my_series['a':'c']

a    10
b    20
c    30
dtype: int64

In [58]:
# Output the result of element-wise mathematical operations
my_series + 5

a    15
b    25
c    35
d    45
e    55
f    65
g    75
h    85
dtype: int64

In [59]:
my_series['b'] += 20

In [60]:
my_series /= 2
my_series

a     5.0
b    20.0
c    15.0
d    20.0
e    25.0
f    30.0
g    35.0
h    40.0
dtype: float64

In [61]:
pd.Series([12,14,16,18])

0    12
1    14
2    16
3    18
dtype: int64

**Observation:**

- As we have accessed one and multiple elements in Numpy arrays, we can do it here also in a similar fashion using index or labels.

- In the last example, we saw that element-wise mathematical operations can be performed on series.

---
<a name = Section4></a>
# **4. Pandas DataFrames**
---

- The dataFrames are **2D data structures** having data aligned in **tabular format**.

- The data is aligned in **rows** (also called **index**) and columns and can store any datatypes like int, string, float, boolean.

- They are **highly flexible** and offer a lot of **mathematical functions**.

- In this section, we will learn several aspects of the pandas dataframe and its working.

<a name = Section41></a>
## **4.1 DataFrame Creation**

- First of all we will explore how pandas dataframes are created. So, let's get started...

**Creating a DataFrame from a List**

In [62]:
# Creating a list called fruits
fruits = ['Apple', 'Banana', 'Coconut', 'Dates']

# Creating a pandas dataframe using fruits list
fruits_df = pd.DataFrame(data=fruits, columns=['Fruit'])

# Output the pandas dataframe
fruits_df

     Fruit
0    Apple
1   Banana
2  Coconut
3    Dates

**Creating a DataFrame from Nested Lists**

In [63]:
# Initiate a list of lists
people = [['Rick', 60, 'O+'], ['Morty', 10, 'O+'], ['Summer', 45, 'A-'], ['Beth', 18, 'B+']]

# Creating a pandas dataframe using people list
people_df = pd.DataFrame(data=people, columns=['Name', 'Age', 'Blood Group'])

# Output the pandas dataframe
people_df

     Name  Age Blood Group
0    Rick   60          O+
1   Morty   10          O+
2  Summer   45          A-
3    Beth   18          B+

**Creating a DataFrame from a Dictionary**

In [64]:
# Initiate a dictionary
people = {'Name': ['Rick', 'Morty', 'Summer', 'Beth'], 
          'Age': [60, 10, 45, 18], 
          'Blood Group': ['O+', 'O+', 'A-', 'B+']}

# Creating a pandas dataframe using people list
people_df = pd.DataFrame(data=people)

# Output the pandas dataframe
people_df

     Name  Age Blood Group
0    Rick   60          O+
1   Morty   10          O+
2  Summer   45          A-
3    Beth   18          B+

**Observation:**

- From the above examples you get to know how to create dataframes using various inputs like lists, nested lists, and a dicitionary.

- Also note that pandas dataframes are mutable and potentially hetrogenous tabular data structure.

<a name = Section42></a>
## **4.2 Loading Files into DataFrame**

- DataFrames can load data from many types of files like **csv, json, excel sheets, text**, etc.

- You can **also load files** in dataframe present on the web by **providing url** in the parameter list.

- Below all the methods explained are applicable for the web files too.

- Lets learn how to do this one by one, first by using:

**Loading CSV file into DataFrame**

In [65]:
# Loading csv files using pandas .read_csv() method
csv_df = pd.read_csv(filepath_or_buffer='C:/Users/deepe/Downloads/supermarkets.csv')

# Output the dataframe
csv_df

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

**Loading JSON file into DataFrame**

In [66]:
# Loading json files using pandas .read_json() method
json_df = pd.read_json(path_or_buf='https://raw.githubusercontent.com/insaid2018/Term-1/master/Data/Casestudy/supermarkets.json')

# Output the dataframe
json_df

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

**Loading Excel file into DataFrame**

In [67]:
# Loading first sheet from excel file using pandas .read_excel() method
excel_df = pd.read_excel(io='https://github.com/insaid2018/Term-1/blob/master/Data/Casestudy/supermarkets.xlsx?raw=true', sheet_name=0)

# Output the dataframe
excel_df

,ID,Address,City,State,Country,Supermarket Name,Number of Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [ ]:
# , ; | <tab> <space> excel json

**Loading CSV files separated by semi-colon ;**

In [68]:
# Loading csv files using pandas .read_csv() method
txt_df = pd.read_csv('https://raw.githubusercontent.com/insaid2018/Term-1/master/Data/Casestudy/supermarkets-semi-colons.txt', sep=';')

# Output the dataframe
txt_df

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

**Observation:**

- We observed how to load data from various types of files such as csv, json, excel etc.

- We also used sep argument to segment the datasheet by various formats.

- There are many more parameters that one must explore to find hidden functionalities.

<a name = Section43></a>
## **4.3 DataFrame Attributes**

- After loading your DataFrame you may be interested to know about the **columns, shape, datatypes**.

- There are many functions in pandas to check all the different attributes of a DataFrame.

In [69]:
# Loading csv files using pandas .read_csv() method
data = pd.read_csv(filepath_or_buffer='https://raw.githubusercontent.com/insaid2018/Term-1/master/Data/Casestudy/supermarkets.csv')

# Output the dataframe
data

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [70]:
type(data)

pandas.core.frame.DataFrame

**DataFrame Resolution**

In [71]:
# To check the resolution of the dataframe
print('DataFrame Resolution:', data.shape)

DataFrame Resolution: (6, 7)

**DataType of Columns**

In [72]:
# To check the data types of columns in dataframe
print('Data Type of Columns\n', data.dtypes)

Data Type of Columns
 ID            int64
Address      object
City         object
State        object
Country      object
Name         object
Employees     int64
dtype: object

In [73]:
data.index

RangeIndex(start=0, stop=6, step=1)

In [86]:
data.columns[2]

'City'

In [77]:
type(data.columns)

pandas.core.indexes.base.Index

**Information about the Dataset**

In [87]:
data.info() #method

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   ID         6 non-null      int64
 1   Address    6 non-null      object
 2   City       6 non-null      object
 3   State      6 non-null      object
 4   Country    6 non-null      object
 5   Name       6 non-null      object
 6   Employees  6 non-null      int64
dtypes: int64(2), object(5)
memory usage: 464.0+ bytes

**Get Total Records in Columns**

In [88]:
data.count()

ID           6
Address      6
City         6
State        6
Country      6
Name         6
Employees    6
dtype: int64

In [96]:
#missing value
data.shape[0]-data.count()

ID           0
Address      0
City         0
State        0
Country      0
Name         0
Employees    0
dtype: int64

In [ ]:
#100 charirs, out of these 90 are not empty. How many empty = 100-90 = 10

#100 rows, out of which 90 were non null. How many numm = 100-90 = 10

**Get Index range of Dataset**

In [97]:
data.index

RangeIndex(start=0, stop=6, step=1)

**Get Index of Dataset Columns**

In [98]:
data.columns

Index(['ID', 'Address', 'City', 'State', 'Country', 'Name', 'Employees'], dtype='object')

**Set Column as Index**

In [100]:
# Creating a new dataframe and setting Name as index
data2 = data.set_index(keys='City')

# Output the dataframe
data2

,ID,Address,State,Country,Name,Employees
City,,,,,,
San Francisco,1,3666 21st St,CA 94114,USA,Madeira,8
San Francisco,2,735 Dolores St,CA 94119,USA,Bready Shop,15
San Francisco,3,332 Hill St,California 94114,USA,Super River,25
San Francisco,4,3995 23rd St,CA 94114,USA,Ben's Shop,10
San Francisco,5,1056 Sanchez St,California,USA,Sanchez,12
San Francisco,6,551 Alvarado St,CA 94114,USA,Richvalley,20

In [101]:
data2.reset_index()

,City,ID,Address,State,Country,Name,Employees
0,San Francisco,1,3666 21st St,CA 94114,USA,Madeira,8
1,San Francisco,2,735 Dolores St,CA 94119,USA,Bready Shop,15
2,San Francisco,3,332 Hill St,California 94114,USA,Super River,25
3,San Francisco,4,3995 23rd St,CA 94114,USA,Ben's Shop,10
4,San Francisco,5,1056 Sanchez St,California,USA,Sanchez,12
5,San Francisco,6,551 Alvarado St,CA 94114,USA,Richvalley,20

In [102]:
data

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [105]:
data[data.columns[2]]

0    San Francisco
1    San Francisco
2    San Francisco
3    San Francisco
4    San Francisco
5    San Francisco
Name: City, dtype: object

In [108]:
data['City']

0    San Francisco
1    San Francisco
2    San Francisco
3    San Francisco
4    San Francisco
5    San Francisco
Name: City, dtype: object

In [112]:
#data.City
#dont do it in this way
data

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [115]:
data.iloc[2]['State']

'California 94114'

In [119]:
data['State'][2]

'California 94114'

In [123]:
data.iloc[2:4]

,ID,Address,City,State,Country,Name,Employees
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10

In [128]:
data[data.columns[2:5]]

pandas.core.frame.DataFrame

**Observation:**

- We observed various dataframe attributes and its associated functions that we can use to extract basic information about the data.

<a name = Section44></a>
## **4.4 Access, Add & Drop Operations**

- In this section, we will see how to perform basic DataFrame operations like,

  - Access Columns in a Dataframe

  - Adding Column to Existing Column in a Dataframe

  - Drop Rows or Columns in a Dataframe

In [129]:
import numpy as np
import pandas as pd

In [130]:
# Loading csv files using pandas .read_csv() method
data = pd.read_csv(filepath_or_buffer='https://raw.githubusercontent.com/insaid2018/Term-1/master/Data/Casestudy/supermarkets.csv')

# Output the dataframe
data

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

**Selecting Rows or Columns in a Dataframe**

In [131]:
# Selecting Address column from the dataset
# Accessing one column from dataframe will return a series
data['Address']

0       3666 21st St
1     735 Dolores St
2        332 Hill St
3       3995 23rd St
4    1056 Sanchez St
5    551 Alvarado St
Name: Address, dtype: object

In [132]:
# Selecting multiple coluns from the dataset
data[['Address', 'Name']]

           Address         Name
0     3666 21st St      Madeira
1   735 Dolores St  Bready Shop
2      332 Hill St  Super River
3     3995 23rd St   Ben's Shop
4  1056 Sanchez St      Sanchez
5  551 Alvarado St   Richvalley

**Adding Column to Existing Dataframe**

In [133]:
data['Salary'] = [1000,5000,4000,3000,6000,2400]
#behave as if the column already existed and just assign the value

In [134]:
data

,ID,Address,City,State,Country,Name,Employees,Salary
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8,1000
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15,5000
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25,4000
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10,3000
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12,6000
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20,2400

In [135]:
data['Total Salary'] = data['Employees']*data['Salary']

In [ ]:
#countries
# data[gdp_per_capita] = data[gdp]/data[population]

#creating new features from the existing ones - FEATURE ENGINEERING

- These processes are generally used in Feature Engineering where we combine 2 or more columns to create more meaningful features.

**Deleting Rows or Columns in a Dataframe**

In [138]:
# Calling data object that we modified earlier
data

,ID,Address,City,State,Country,Name,Employees,Salary,Total Salary
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8,1000,8000
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15,5000,75000
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25,4000,100000
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10,3000,30000
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12,6000,72000
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20,2400,48000

In [139]:
data.shape

(6, 9)

In [153]:
# Drop ID column along column axis in original dataframe
# Setting the inplace=False will not perform any operations on original data
data.drop(labels=['ID'], axis=1, inplace = True)

KeyError: "['ID'] not found in axis"

0    San Francisco
1    San Francisco
2    San Francisco
3    San Francisco
4    San Francisco
5    San Francisco
Name: City, dtype: object

In [146]:
data_new = data.drop(labels=['City'], axis=1, inplace=False)

In [147]:
data

,Address,City,State,Country,Name,Employees,Salary,Total Salary
0,3666 21st St,San Francisco,CA 94114,USA,Madeira,8,1000,8000
1,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15,5000,75000
2,332 Hill St,San Francisco,California 94114,USA,Super River,25,4000,100000
3,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10,3000,30000
4,1056 Sanchez St,San Francisco,California,USA,Sanchez,12,6000,72000
5,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20,2400,48000

- To drop rows we need pass the index of the rows in .drop() function.

In [148]:
# Dropping first record with affecting our original dataset
data.drop(labels=[0], axis=0, inplace=False)

,Address,City,State,Country,Name,Employees,Salary,Total Salary
1,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15,5000,75000
2,332 Hill St,San Francisco,California 94114,USA,Super River,25,4000,100000
3,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10,3000,30000
4,1056 Sanchez St,San Francisco,California,USA,Sanchez,12,6000,72000
5,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20,2400,48000

- You can also use labels as index for the rows and drop rows based on those labels.

In [16]:
# Creating a new variable where Name column is set as index
data2 = data.set_index(keys=['Name'], inplace=False)

# Output the dataframe
data2

,Address,City,State,Country,Employees,Salary,Total Salary
Name,,,,,,,
Madeira,3666 21st St,San Francisco,CA 94114,USA,8,10000,80000
Bready Shop,735 Dolores St,San Francisco,CA 94119,USA,15,20000,300000
Super River,332 Hill St,San Francisco,California 94114,USA,25,30000,750000
Ben's Shop,3995 23rd St,San Francisco,CA 94114,USA,10,40000,400000
Sanchez,1056 Sanchez St,San Francisco,California,USA,12,50000,600000
Richvalley,551 Alvarado St,San Francisco,CA 94114,USA,20,60000,1200000

In [17]:
# Dropping record that contains Sanchez without affecting our original dataset
data2.drop(labels=['Sanchez'], axis=0, inplace=False)

,Address,City,State,Country,Employees,Salary,Total Salary
Name,,,,,,,
Madeira,3666 21st St,San Francisco,CA 94114,USA,8,10000,80000
Bready Shop,735 Dolores St,San Francisco,CA 94119,USA,15,20000,300000
Super River,332 Hill St,San Francisco,California 94114,USA,25,30000,750000
Ben's Shop,3995 23rd St,San Francisco,CA 94114,USA,10,40000,400000
Richvalley,551 Alvarado St,San Francisco,CA 94114,USA,20,60000,1200000

In [152]:
data

,Address,City,State,Country,Name,Employees,Salary,Total Salary
0,3666 21st St,San Francisco,CA 94114,USA,Madeira,8,1000,8000
1,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15,5000,75000
2,332 Hill St,San Francisco,California 94114,USA,Super River,25,4000,100000
3,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10,3000,30000
4,1056 Sanchez St,San Francisco,California,USA,Sanchez,12,6000,72000
5,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20,2400,48000

**Observation:**

- We have seen how to use select, add, and drop records or columns from a dataframe.

- The use of these operations may differ according to the objective need.

- For example, you use **dropping operations** when you have **null data** or **outliers**.

<a name = Section45></a>
## **4.5 DataFrame Indexing**

- There are **two types** of indexing that we can perform in Pandas dataframe.

  - Using numbers (row or column index) using .iloc[].

  - Using names (row name or column name) using .loc[].

In [154]:
#index - 0,1,2,3...

#slicing - [x:y] start with x inclusive, go till y but dont include y

In [157]:
# Loading remote csv files using pandas .read_csv() method and setting ID as index
market_df = pd.read_csv(filepath_or_buffer='https://raw.githubusercontent.com/insaid2018/Term-1/master/Data/Casestudy/supermarkets.csv', index_col='ID')

# Output the dataframe
market_df

,Address,City,State,Country,Name,Employees
ID,,,,,,
1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
3,332 Hill St,San Francisco,California 94114,USA,Super River,25
4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

**Indexing using .iloc[]**: Purely integer-location based indexing for selection by position.

In [158]:
# Accessing rows (0th to 4th index) and columns (1st to 3rd index) in a dataframe
market_df.iloc[0:4,1:3]

             City             State
ID
1   San Francisco          CA 94114
2   San Francisco          CA 94119
3   San Francisco  California 94114
4   San Francisco          CA 94114

In [159]:
# Accessing rows (all) and columns (0th to 5th index) in a dataframe
market_df.iloc[:, 0:5]

            Address           City             State Country         Name
ID
1      3666 21st St  San Francisco          CA 94114     USA      Madeira
2    735 Dolores St  San Francisco          CA 94119     USA  Bready Shop
3       332 Hill St  San Francisco  California 94114     USA  Super River
4      3995 23rd St  San Francisco          CA 94114     USA   Ben's Shop
5   1056 Sanchez St  San Francisco        California     USA      Sanchez
6   551 Alvarado St  San Francisco          CA 94114     USA   Richvalley

In [160]:
# Accessing rows (0th to 4th index) and columns (all) in a dataframe
market_df.iloc[0:4, :]

,Address,City,State,Country,Name,Employees
ID,,,,,,
1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
3,332 Hill St,San Francisco,California 94114,USA,Super River,25
4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10

**Indexing using .loc[]**: Access a group of rows and columns by label(s) or a boolean array.

In [163]:
# Accessing rows (3rd to 5th index) and columns (Address) in a dataframe
# As we are accessing only one column it will be returned as a series
market_df.loc[3:5, 'Address']

ID
3        332 Hill St
4       3995 23rd St
5    1056 Sanchez St
Name: Address, dtype: object

In [164]:
# Accessing rows (1st to 4th index) and columns (Address to Country) in a dataframe
market_df.loc[1:4, 'Address':'Country']

           Address           City             State Country
ID
1     3666 21st St  San Francisco          CA 94114     USA
2   735 Dolores St  San Francisco          CA 94119     USA
3      332 Hill St  San Francisco  California 94114     USA
4     3995 23rd St  San Francisco          CA 94114     USA

In [24]:
# Accessing rows (all) and columns (State to all) in a dataframe
market_df.loc[:, 'State':]

               State Country         Name  Employees
ID
1           CA 94114     USA      Madeira          8
2           CA 94119     USA  Bready Shop         15
3   California 94114     USA  Super River         25
4           CA 94114     USA   Ben's Shop         10
5         California     USA      Sanchez         12
6           CA 94114     USA   Richvalley         20

**Observation:**

- We observed how to index data elements (rows and columns) using .loc[] and .iloc[].

- You can use these operations to separate features into numerical and categorical columns.

<a name = Section46></a>
## **4.6 Append, Concat & Merge Operations**

- In this section we will see how to append, merge and concatenate two or more dataframes.

**Appending DataFrames**: For full documentation of the function click <a href="https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.append.html">**here**</a>.

In [165]:
# Creating custom data of data science students
data_dict = {'id':[1, 2, 3, 4, 5], 'name':['Suchit', 'Mohit', 'Mukesh', 'Hemanka', 'Ashish'], 
             'language':['English', 'Hindi', 'Punjabi', 'Hindi', 'Hindi']}

# Creating dataframe out of data_dict variable
df1 = pd.DataFrame(data=data_dict)

# Output the dataframe
df1

   id     name language
0   1   Suchit  English
1   2    Mohit    Hindi
2   3   Mukesh  Punjabi
3   4  Hemanka    Hindi
4   5   Ashish    Hindi

In [166]:
# Creating another dataframe that contains only one row
df2 = pd.DataFrame(data={'id': [6], 'name': ['Hiren'], 'language': ['English']})

# Output the dataframe
df2

   id   name language
0   6  Hiren  English

In [167]:
# Creating a third dataframe by appending df2 to df1
df3 = df1.append(other=df2)

# Output the dataframe
df3

   id     name language
0   1   Suchit  English
1   2    Mohit    Hindi
2   3   Mukesh  Punjabi
3   4  Hemanka    Hindi
4   5   Ashish    Hindi
0   6    Hiren  English

**Observation:** 

- Did you observed the index of the row from second dataframe?

- Well there a solution to that as well, just set ignore_index to True.

In [168]:
# Creating a third dataframe by appending df2 to df1 and ingoring index
df3 = df1.append(df2, ignore_index=True)

# Output the dataframe
df3

   id     name language
0   1   Suchit  English
1   2    Mohit    Hindi
2   3   Mukesh  Punjabi
3   4  Hemanka    Hindi
4   5   Ashish    Hindi
5   6    Hiren  English

**Concatenating DataFrames**: For full documentation of the function click <a href="https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.concat.html">**here**</a>.

In [169]:
# Creating custom dataset 1
data_dict1 = {'id': [1, 2, 3, 4, 5], 'name': ['a', 'b', 'c', 'd', 'e'], 
              'sub': ['sub1', 'sub2', 'sub3', 'sub4', 'sub5']
              }

# Creating custom dataset 2              
data_dict2 = {'id': [1, 2, 3, 4, 5], 'name': ['b', 'c', 'd', 'e', 'f'],
              'sub': ['sub3', 'sub4', 'sub5', 'sub6', 'sub7']
              }

# Creating dataframes out of custom data dictionaries
df1 = pd.DataFrame(data=data_dict1)
df2 = pd.DataFrame(data=data_dict2)

In [170]:
df1

   id name   sub
0   1    a  sub1
1   2    b  sub2
2   3    c  sub3
3   4    d  sub4
4   5    e  sub5

In [171]:
df2

   id name   sub
0   1    b  sub3
1   2    c  sub4
2   3    d  sub5
3   4    e  sub6
4   5    f  sub7

In [11]:
# Creating a third dataframe by concatenating df2 to df1 along row axis
df3 = pd.concat(objs=[df1, df2], axis=0) #appending

# Output the dataframe
df3

   id name   sub
0   1    a  sub1
1   2    b  sub2
2   3    c  sub3
3   4    d  sub4
4   5    e  sub5
0   1    b  sub3
1   2    c  sub4
2   3    d  sub5
3   4    e  sub6
4   5    f  sub7

In [172]:
# Creating a third dataframe by concatenating df2 to df1 along column axis
df3 = pd.concat(objs=[df1, df2], axis=1)

# Output the dataframe
df3

   id name   sub  id name   sub
0   1    a  sub1   1    b  sub3
1   2    b  sub2   2    c  sub4
2   3    c  sub3   3    d  sub5
3   4    d  sub4   4    e  sub6
4   5    e  sub5   5    f  sub7

**Merging DataFrames**: For full documentation of the function click <a href="https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.merge.html">**here**</a>.

- Merging can happen on a columns that have common name or we can specify how to join two tables.

- There are following types of merging that we can perform on two dataframes:

  - **Left Join:** It use only **keys from left frame**, similar to a SQL left outer join; preserve key order.

  - **Right Join:** It use only **keys from right frame**, similar to a SQL right outer join; preserve key order.

  - **Outer Join:** It use union of **keys from both frames**, similar to a SQL full outer join; sort keys lexicographically.

  - **Inner Join (default):** It use **intersection** of **keys from both frames**, similar to a SQL inner join; preserve the order of the left keys.

  - **Cross Join:** It creates the **cartesian product** from **both frames**, preserves the order of the left keys.

In [173]:
# Creating custom dataset 1
data_dict1 = {'emp_id': [1, 2, 3, 4, 5], 'emp_name': ['a', 'b', 'c', 'd', 'e'], 
              'sub': ['sub1', 'sub2', 'sub3', 'sub4', 'sub5']
              }

# Creating custom dataset 2              
data_dict2 = {'dept_id': [1, 2, 3, 4, 5], 'dept_name': ['b', 'c', 'd', 'e', 'f'],
              'sub': ['sub3', 'sub4', 'sub5', 'sub6', 'sub7']
              }

# Creating dataframes out of custom data dictionaries
df1 = pd.DataFrame(data=data_dict1)
df2 = pd.DataFrame(data=data_dict2)

In [16]:
df1

   emp_id emp_name   sub
0       1        a  sub1
1       2        b  sub2
2       3        c  sub3
3       4        d  sub4
4       5        e  sub5

In [174]:
df2

   dept_id dept_name   sub
0        1         b  sub3
1        2         c  sub4
2        3         d  sub5
3        4         e  sub6
4        5         f  sub7

In [175]:
# Merging dataframe df1 and df2 based on common column name
pd.merge(left=df1, right=df2, on='sub', how = 'left')

   emp_id emp_name   sub  dept_id dept_name
0       1        a  sub1      NaN       NaN
1       2        b  sub2      NaN       NaN
2       3        c  sub3      1.0         b
3       4        d  sub4      2.0         c
4       5        e  sub5      3.0         d

In [176]:
# Merging dataframe df1 and df2 based on df1's sub values
pd.merge(left=df1, right=df2, on='sub', how='inner')

   emp_id emp_name   sub  dept_id dept_name
0       3        c  sub3        1         b
1       4        d  sub4        2         c
2       5        e  sub5        3         d

In [177]:
# Merging dataframe df1 and df2 based on df2's sub values
pd.merge(left=df1, right=df2, on='sub', how='outer')

   emp_id emp_name   sub  dept_id dept_name
0     1.0        a  sub1      NaN       NaN
1     2.0        b  sub2      NaN       NaN
2     3.0        c  sub3      1.0         b
3     4.0        d  sub4      2.0         c
4     5.0        e  sub5      3.0         d
5     NaN      NaN  sub6      4.0         e
6     NaN      NaN  sub7      5.0         f

In [178]:
# Merging dataframe df1 and df2 based on union of both sub column
pd.merge(left=df1, right=df2, on='sub', how='right')

   emp_id emp_name   sub  dept_id dept_name
0     3.0        c  sub3        1         b
1     4.0        d  sub4        2         c
2     5.0        e  sub5        3         d
3     NaN      NaN  sub6        4         e
4     NaN      NaN  sub7        5         f

**Observation:**

- We learned how to concatenate, merge and append dataframes using corresponding functions.

- They are widely used while collecting data from multiple data sources.

<a name = Section47></a>
## **4.7 Data Filteration**

- In this section, we will observe how to perform data filtration operations.

- Remember? the **output** of the **comparison** is of **boolean data** type i.e. True or False.

- You can use this **boolean** to **filter** out **records** from the DataFrame.

In [179]:
# Loading remote csv files using pandas .read_csv() method and setting ID as index
market_df = pd.read_csv(filepath_or_buffer='C:/Users/deepe/Downloads/supermarkets.csv')

# Output the dataframe
market_df

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [180]:
# Returns True of False if Employees are greater than 15
market_df['Employees'] >= 15

0    False
1     True
2     True
3    False
4    False
5     True
Name: Employees, dtype: bool

- We can use the above output in a dataframe to filter out important information.

In [181]:
# Filter out all the rows where Employees are greater than equal to 15
market_df[market_df['Employees'] >= 15]

,ID,Address,City,State,Country,Name,Employees
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [182]:
# Filter out all the rows where Employees >= 15 and State is not equal to CA 94119
market_df[(market_df['Employees'] >= 15) & (market_df['State'] != 'CA 94119')]

,ID,Address,City,State,Country,Name,Employees
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [183]:
# Filter out all the rows where Employees >= 15 or State is not equal to CA 94119
market_df[(market_df['Employees'] >= 15) | (market_df['State'] != 'CA 94119')]

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [184]:
market_df[market_df['Name']== 'Richvalley']

   ID          Address           City     State Country        Name  Employees
5   6  551 Alvarado St  San Francisco  CA 94114     USA  Richvalley         20

**Observation:**

- We observed how easy it is to filter out information from the dataframes.

- They also help us to get a clear picture of data by logically operating on combinations of various features.

- Therefore these functions are widely used in Feature Engineering.

<a name = Section48></a>
## **4.8 Multi-Indexed DataFrames**

- Until now you have seen DataFrames with a single index. 

- Lets see how we can use more than 1 index to gain better insights.

In [185]:
# Creating custom data dictionary of company
company_df = {'Company':['Google', 'Google', 'Google', 'Microsoft', 'Microsoft', 'Microsoft'],
              'Year' : [2008, 2009, 2010, 2008, 2009, 2010],
              'Revenue' : [11, 15, 16, 9, 12, 14],
              'Employee' : [300, 400, 500, 350, 450, 550]
              }

# Creating custom dataframe out of company_df
cmp_df = pd.DataFrame(data=company_df)

# Output the dataframe
cmp_df

     Company  Year  Revenue  Employee
0     Google  2008       11       300
1     Google  2009       15       400
2     Google  2010       16       500
3  Microsoft  2008        9       350
4  Microsoft  2009       12       450
5  Microsoft  2010       14       550

- Now we will set Company and Year as index and try to access rows.

In [186]:
# Set Company and Year as index values
cmp_df.set_index(keys=['Company', 'Year'], inplace=True)

# Display the output the modified dataframe
cmp_df

                Revenue  Employee
Company   Year
Google    2008       11       300
          2009       15       400
          2010       16       500
Microsoft 2008        9       350
          2009       12       450
          2010       14       550

- Let's say we are interested in accessing data for **Google** of year **2009**.

- We won't be able to access data directly and we will end up getting error as shown below:

In [187]:
cmp_df.loc['Google']

      Revenue  Employee
Year
2008       11       300
2009       15       400
2010       16       500

In [188]:
# Accessing data by using .loc[] two times
cmp_df.loc['Google'].loc[2009]

Revenue      15
Employee    400
Name: 2009, dtype: int64

- The above approach is not bad, but there's a **better way** we can peform **accessing of rows** that are **indexed** with **multiple** values.

- We will use **.xs()** function of pandas.

In [191]:
# Accessing Microsoft data at Company level or index level 0
cmp_df.xs(key=2009, level='Year')

           Revenue  Employee
Company
Google          15       400
Microsoft       12       450

In [193]:
# Accessing data of year 2009
cmp_df.xs(key=2009, level='Year')

           Revenue  Employee
Company
Google          15       400
Microsoft       12       450

- Let's observe multi-indexing over different dataset.

In [195]:
# Loading synthetic data present in seaborn library
import seaborn as sns
tips = sns.load_dataset(name='tips', cache=True)

# Output the dataframe
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [196]:
# Setting sex and size as index of the dataframe
tips.set_index(keys=['sex','size'], inplace=True)

# Output the dataframe
tips

             total_bill   tip smoker   day    time
sex    size
Female 2          16.99  1.01     No   Sun  Dinner
Male   3          10.34  1.66     No   Sun  Dinner
       3          21.01  3.50     No   Sun  Dinner
       2          23.68  3.31     No   Sun  Dinner
Female 4          24.59  3.61     No   Sun  Dinner
...                 ...   ...    ...   ...     ...
Male   3          29.03  5.92     No   Sat  Dinner
Female 2          27.18  2.00    Yes   Sat  Dinner
Male   2          22.67  2.00    Yes   Sat  Dinner
       2          17.82  1.75     No   Sat  Dinner
Female 2          18.78  3.00     No  Thur  Dinner

[244 rows x 5 columns]

In [197]:
# Sorting out the index in ascending order
tips.sort_index(inplace=True)

# Output the dataframe
tips

             total_bill   tip smoker   day    time
sex    size
Male   1           8.58  1.92    Yes   Fri   Lunch
       2          23.68  3.31     No   Sun  Dinner
       2           8.77  2.00     No   Sun  Dinner
       2          15.04  1.96     No   Sun  Dinner
       2          14.78  3.23     No   Sun  Dinner
...                 ...   ...    ...   ...     ...
Female 4          43.11  5.00    Yes  Thur   Lunch
       4          30.14  3.09    Yes   Sat  Dinner
       5          29.85  5.14     No   Sun  Dinner
       6          29.80  4.20     No  Thur   Lunch
       6          27.05  5.00     No  Thur   Lunch

[244 rows x 5 columns]

In [198]:
# Access all records where size = 2
tips.xs(key=2, level='size')

        total_bill   tip smoker   day    time
sex
Male         23.68  3.31     No   Sun  Dinner
Male          8.77  2.00     No   Sun  Dinner
Male         15.04  1.96     No   Sun  Dinner
Male         14.78  3.23     No   Sun  Dinner
Male         10.27  1.71     No   Sun  Dinner
...            ...   ...    ...   ...     ...
Female       16.27  2.50    Yes   Fri   Lunch
Female       10.09  2.00    Yes   Fri   Lunch
Female       22.12  2.88    Yes   Sat  Dinner
Female       27.18  2.00    Yes   Sat  Dinner
Female       18.78  3.00     No  Thur  Dinner

[156 rows x 5 columns]

In [199]:
tips.xs(key='Female', level='sex')

      total_bill   tip smoker   day    time
size
1           3.07  1.00    Yes   Sat  Dinner
1          10.07  1.83     No  Thur   Lunch
1           7.25  1.00     No   Sat  Dinner
2          16.99  1.01     No   Sun  Dinner
2          14.83  3.02     No   Sun  Dinner
...          ...   ...    ...   ...     ...
4          43.11  5.00    Yes  Thur   Lunch
4          30.14  3.09    Yes   Sat  Dinner
5          29.85  5.14     No   Sun  Dinner
6          29.80  4.20     No  Thur   Lunch
6          27.05  5.00     No  Thur   Lunch

[87 rows x 5 columns]

**Observation:**

- When dealing with multiple indices we have seen how to access data using .xs() function. 

- Also, we have seen creating an index using categorical variables.

<a name = Section49></a>
## **4.9 Groupby in Pandas**

- Groupby allows you to **group together rows** based on a **column** and perform an **aggregate function** on them.

- This is quiet a handy tool if you don't want to change the index of the DataFrame.

In [67]:
# Loading synthetic data present in seaborn library
tips = sns.load_dataset(name='tips', cache=True)

# Output top 5 rows of the dataframe
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [68]:
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [74]:
# Group by data based on time column estimating total rows
tips.groupby(by=['sex','day']).mean()

             total_bill       tip      size
sex    day
Male   Thur   18.714667  2.980333  2.433333
       Fri    19.857000  2.693000  2.100000
       Sat    20.802542  3.083898  2.644068
       Sun    21.887241  3.220345  2.810345
Female Thur   16.715312  2.575625  2.468750
       Fri    14.145556  2.781111  2.111111
       Sat    19.680357  2.801786  2.250000
       Sun    19.872222  3.367222  2.944444

In [70]:
# Group by data based on time column estimating mean of numerical columns
tips.groupby(by=['time']).mean()

        total_bill       tip      size
time
Lunch    17.168676  2.728088  2.411765
Dinner   20.797159  3.102670  2.630682

In [39]:
# Group by data based on time column estimating mean of numerical columns
tips.groupby(by=['time']).agg('total_bill')

In [40]:
# Group by data based on time column estimating min and max of total_bill and sum of tip
tips.groupby('time').agg({'total_bill': ['min', 'max'], 'tip': 'sum'})

       total_bill            tip
              min    max     sum
time
Lunch        7.51  43.11  185.51
Dinner       3.07  50.81  546.07

In [42]:
tips.groupby('time').mean()['tip'].loc['Lunch']

2.7280882352941176

**Observation:**

- We observed how useful groupby method is when it comes to analyzing data.

<a name = Section410></a>
## **4.10 DataFrame Operations**

- There are some basic operations that we can apply on any dataframe and these are as follows:
  - **.unique():** Hash table-based unique values are returned in order of appearance.

  - **.nunique():** Count distinct observations over requested axis.

  - **.value_counts():** Return a Series containing counts of unique values.

  - **.apply():** Apply a function along an axis of the DataFrame.
  
  - **.sort_values():** Sort by the values along either axis.

In [75]:
# Creating a list of lists
people = [['Rick', 60, 'O+'], ['Morty', 10, 'O+'], ['Summer', 45, 'A-'], ['Beth', 18, 'B+']]

# Creating dataframe out of people list
people_df = pd.DataFrame(data=people, columns=['Name', 'Score', 'Blood Group'])

# Output the dataframe
people_df

     Name  Score Blood Group
0    Rick     60          O+
1   Morty     10          O+
2  Summer     45          A-
3    Beth     18          B+

In [77]:
# Display the unique labels in Blood Group
print('Unique values in Blood Group:', people_df['Blood Group'].unique())

# Dispaly the unique count in Blood Group
print('Unique count in Blood Group:', people_df['Blood Group'].nunique())

Unique values in Blood Group: ['O+' 'A-' 'B+']
Unique count in Blood Group: 3

In [78]:
# Return a Series of Blood Group containing counts of unique values.
people_df['Blood Group'].value_counts()

O+    2
B+    1
A-    1
Name: Blood Group, dtype: int64

In [79]:
def times2(x):
    #too complicated c ode
    return x*2

In [80]:
# Apply a times2 function along an axis of the DataFrame.
# people_df['Score Times2'] = people_df['Score'].apply(lambda x: x * 2)
people_df['Score Times2'] = people_df['Score'].apply(times2)

# Output the dataframe
people_df

     Name  Score Blood Group  Score Times2
0    Rick     60          O+           120
1   Morty     10          O+            20
2  Summer     45          A-            90
3    Beth     18          B+            36

In [81]:
people_df['Score Times2 new'] = people_df['Score']*2
people_df

     Name  Score Blood Group  Score Times2  Score Times2 new
0    Rick     60          O+           120               120
1   Morty     10          O+            20                20
2  Summer     45          A-            90                90
3    Beth     18          B+            36                36

In [82]:
# Sort the dataframe based on score column in ascending order
people_df.sort_values(by='Score', ascending=True)

     Name  Score Blood Group  Score Times2  Score Times2 new
1   Morty     10          O+            20                20
3    Beth     18          B+            36                36
2  Summer     45          A-            90                90
0    Rick     60          O+           120               120

**Observation:**

- We observed various operations that can be applied on the dataframe.

<a name = Section411></a>
## **4.11 Time Series Operations**

- In this section, we will observe how to perform time series related operations when time as a factor is associcated.

In [83]:
# Loading remote csv files using pandas .read_csv() method and setting ID as index
air_df = pd.read_csv(filepath_or_buffer='https://raw.githubusercontent.com/insaid2018/Term-1/master/Data/Casestudy/AirQualityUCI.csv')

# Output the top 5 rows in dataframe
air_df.head()

,Date,Time,CO(GT),PT08.S1(CO),NMHC(GT),C6H6(GT),PT08.S2(NMHC),NOx(GT),PT08.S3(NOx),NO2(GT),PT08.S4(NO2),PT08.S5(O3),T,RH,AH
0,3/10/2004,18:00:00,2.6,1360,150,11.9,1046,166,1056,113,1692,1268,13.6,48.9,0.7578
1,3/10/2004,19:00:00,2.0,1292,112,9.4,955,103,1174,92,1559,972,13.3,47.7,0.7255
2,3/10/2004,20:00:00,2.2,1402,88,9.0,939,131,1140,114,1555,1074,11.9,54.0,0.7502
3,3/10/2004,21:00:00,2.2,1376,80,9.2,948,172,1092,122,1584,1203,11.0,60.0,0.7867
4,3/10/2004,22:00:00,1.6,1272,51,6.5,836,131,1205,116,1490,1110,11.2,59.6,0.7888

- Let's get some basic information about the columns in our dataset.

In [84]:
air_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9357 entries, 0 to 9356
Data columns (total 15 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           9357 non-null   object
 1   Time           9357 non-null   object
 2   CO(GT)         9357 non-null   float64
 3   PT08.S1(CO)    9357 non-null   int64
 4   NMHC(GT)       9357 non-null   int64
 5   C6H6(GT)       9357 non-null   float64
 6   PT08.S2(NMHC)  9357 non-null   int64
 7   NOx(GT)        9357 non-null   int64
 8   PT08.S3(NOx)   9357 non-null   int64
 9   NO2(GT)        9357 non-null   int64
 10  PT08.S4(NO2)   9357 non-null   int64
 11  PT08.S5(O3)    9357 non-null   int64
 12  T              9357 non-null   float64
 13  RH             9357 non-null   float64
 14  AH             9357 non-null   float64
dtypes: float64(5), int64(8), object(2)
memory usage: 1.1+ MB

- We can observe that **Date** and **Time** features are **identified as object**, **instead** they **should be datetime**.

- We can **correct** this **schema** by **casting** it to the datetime along with specific datetime format.

- For better visibility we will take only first row for now.

In [15]:
air_df.head(1)

        Date      Time  CO(GT)  PT08.S1(CO)  ...  PT08.S5(O3)     T    RH      AH
0  3/10/2004  18:00:00     2.6         1360  ...         1268  13.6  48.9  0.7578

[1 rows x 15 columns]

In [85]:
# Casting Date column to datetime format
air_df['Date'] = pd.to_datetime(arg=air_df['Date'], format='%m/%d/%Y')

# Display the type of the Date column
print('Date Type:', air_df['Date'].dtype)

Date Type: datetime64[ns]

- Now let's do the same for Time column.

In [86]:
# Casting Time column to datetime format
air_df['Time'] = pd.to_datetime(arg=air_df['Time'], format='%H:%M:%S')

# Display the type of the Time column
print('Time Type:', air_df['Time'].dtype)

Time Type: datetime64[ns]

In [87]:
air_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9357 entries, 0 to 9356
Data columns (total 15 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           9357 non-null   datetime64[ns]
 1   Time           9357 non-null   datetime64[ns]
 2   CO(GT)         9357 non-null   float64
 3   PT08.S1(CO)    9357 non-null   int64
 4   NMHC(GT)       9357 non-null   int64
 5   C6H6(GT)       9357 non-null   float64
 6   PT08.S2(NMHC)  9357 non-null   int64
 7   NOx(GT)        9357 non-null   int64
 8   PT08.S3(NOx)   9357 non-null   int64
 9   NO2(GT)        9357 non-null   int64
 10  PT08.S4(NO2)   9357 non-null   int64
 11  PT08.S5(O3)    9357 non-null   int64
 12  T              9357 non-null   float64
 13  RH             9357 non-null   float64
 14  AH             9357 non-null   float64
dtypes: datetime64[ns](2), float64(5), int64(8)
memory usage: 1.1 MB

In [98]:
9357/24

389.875

- Now, we will see how to extract day, month and year from any date.

- For ease of understanding, we will be using only one row.

In [89]:
air_df['Date'].head(1)

0   2004-03-10
Name: Date, dtype: datetime64[ns]

In [91]:
air_df['Date'].head(5).dt.day

0    10
1    10
2    10
3    10
4    10
Name: Date, dtype: int64

In [94]:
air_df['Date'].iloc[0].day

10

In [95]:
# Extract day from Date column
# We used index to extract only value not a series
day = air_df['Date'].head(1).dt.day[0] #10

# Extract month from Date column
# We used index to extract only value not a series
month = air_df['Date'].head(1).dt.month[0] #03

# Extract year from Date column
# We used index to extract only value not a series
year = air_df['Date'].head(1).dt.year[0] #2004

# Display day
print('Day:', day)

# Display month
print('Month:', month)

# Display year
print('Year:', year)

Day: 10
Month: 3
Year: 2004

In [96]:
# Display the number of unique days
print('Number of Unique Days:', air_df['Date'].dt.day.nunique())

# Display the number of unique months
print('Number of Unique Months:', air_df['Date'].dt.month.nunique())

# Display the number of unique years
print('Number of Unique Months:', air_df['Date'].dt.year.nunique())

Number of Unique Days: 31
Number of Unique Months: 12
Number of Unique Months: 2

In [97]:
air_df['Date'].nunique()

391

- Next, we will see how to extract week number, day of the week, weekday name, day of the year.

- For the sake of simplicity we will be only using first row. 

- The __index of week days__ are provided below.

  - 0 = Monday
  - 1 = Tuesday
  - 2 = Wednesday
  - 3 = Thursday
  - 4 = Friday
  - 5 = Saturday
  - 6 = Sunday

In [100]:
# Display the week number
print('Week Number:', air_df['Date'].head(1).dt.isocalendar().week[0])

# Display the day of the week
print('Day of the week:', air_df['Date'].head(1).dt.dayofweek[0])

# Display weekday name
print('Weekday name:', air_df['Date'].head(1).dt.day_name()[0])

# Display day of the year
print('Day of the year:', air_df['Date'].head(1).dt.dayofyear[0])

Week Number: 11
Day of the week: 2
Weekday name: Wednesday
Day of the year: 70

In [101]:
air_df['WeekNo'] = air_df['Date'].dt.isocalendar().week
air_df

,Date,Time,CO(GT),PT08.S1(CO),NMHC(GT),C6H6(GT),PT08.S2(NMHC),NOx(GT),PT08.S3(NOx),NO2(GT),PT08.S4(NO2),PT08.S5(O3),T,RH,AH,WeekNo
0,2004-03-10,1900-01-01 18:00:00,2.6,1360,150,11.9,1046,166,1056,113,1692,1268,13.6,48.9,0.7578,11
1,2004-03-10,1900-01-01 19:00:00,2.0,1292,112,9.4,955,103,1174,92,1559,972,13.3,47.7,0.7255,11
2,2004-03-10,1900-01-01 20:00:00,2.2,1402,88,9.0,939,131,1140,114,1555,1074,11.9,54.0,0.7502,11
3,2004-03-10,1900-01-01 21:00:00,2.2,1376,80,9.2,948,172,1092,122,1584,1203,11.0,60.0,0.7867,11
4,2004-03-10,1900-01-01 22:00:00,1.6,1272,51,6.5,836,131,1205,116,1490,1110,11.2,59.6,0.7888,11
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9352,2005-04-04,1900-01-01 10:00:00,3.1,1314,-200,13.5,1101,472,539,190,1374,1729,21.9,29.3,0.7568,14
9353,2005-04-04,1900-01-01 11:00:00,2.4,1163,-200,11.4,1027,353,604,179,1264,1269,24.3,23.7,0.7119,14
9354,2005-04-04,1900-01-01 12:00:00,2.4,1142,-200,12.4,1063,293,603,175,1241,1092,26.9,18.3,0.6406,14
9355,2005-04-04,1900-01-01 13:00:00,2.1,1003,-200,9.5,961,235,702,156,1041,770,28.3,13.5,0.5139,14
9356,2005-04-04,1900-01-01 14:00:00,2.2,1071,-200,11.9,1047,265,654,168,1129,816,28.5,13.1,0.5028,14

In [ ]:
#extract qrts - homework

- Next, we will see how to get hours, minutes, seconds from Time column.

- For the sake of simplicity we will take only first row as an example.

In [102]:
# Display hours from Time column
print('Hours:', air_df['Time'].head(1).dt.hour[0])

# Display minutes from Time column
print('Minutes:', air_df['Time'].head(1).dt.minute[0])

# Display seconds from Time column
print('Seconds:', air_df['Time'].head(1).dt.second[0])

Hours: 18
Minutes: 0
Seconds: 0

- We can also perform **conditional filtering** over the rows of dataframe **using datetime** type data.

- Below, we will show you an exmpale how to measure the number of records before 9 a.m.

In [50]:
# Initiating a custom timestap of 9 AM
timestamp = pd.to_datetime(arg="09:00:00", format='%H:%M:%S')

# Display the number of records that are below than the defined timestamp
print('Filtered Data Shape:', air_df[air_df['Time'] < timestamp].shape)

Filtered Data Shape: (3510, 15)

In [ ]:
#group by on date - CO, average in 2005, between 10AM to 5PM - homework

- Let's try to filter the rows that are before 01/01/2005 date.

In [103]:
# Initiating a custom date of 01/01/2005
datestamp = pd.to_datetime("01/01/2005", format='%d/%m/%Y')

# Ouput 5 rows that are before 01/01/2005
air_df[air_df['Date'] < datestamp]

,Date,Time,CO(GT),PT08.S1(CO),NMHC(GT),C6H6(GT),PT08.S2(NMHC),NOx(GT),PT08.S3(NOx),NO2(GT),PT08.S4(NO2),PT08.S5(O3),T,RH,AH,WeekNo
7105,2004-12-31,1900-01-01 19:00:00,-200.0,930,-200,5.3,781,-200,933,-200,906,866,9.3,33.6,0.3958,53
7106,2004-12-31,1900-01-01 20:00:00,-200.0,962,-200,5.3,780,-200,919,-200,909,884,9.6,32.3,0.3871,53
7107,2004-12-31,1900-01-01 21:00:00,-200.0,974,-200,5.5,790,-200,915,-200,895,951,9.1,32.5,0.3766,53
7108,2004-12-31,1900-01-01 22:00:00,-200.0,1055,-200,5.6,791,-200,845,-200,936,1195,9.1,37.2,0.4310,53
7109,2004-12-31,1900-01-01 23:00:00,-200.0,1003,-200,4.6,744,-200,882,-200,899,1138,7.8,38.4,0.4085,53

**Observation:**

- We have seen that by using datetime format we can extract information like year, month, hour, minute, etc from time.

- We can even retrieve the name of the day and day of the year type information.

- All these things **help** to better **understand** our **data** which in turn help in **drawing** important **conclusions** and **insights**.

---
<a name = Section5></a>
# **5. Conclusion**
---

- **Python** is a **great language** for doing data analysis, primarily because of the fantastic ecosystem of data-centric Python packages.

- Pandas is one of those packages and makes **importing** and **analyzing** **data** much **easier**.

- It is an **open-source**, **BSD-licensed** Python library providing high-performance, easy-to-use data structures, and data analysis tools.

- Python with **Pandas** is **used in a wide range of fields** including academic and commercial domains like finance, statistics, etc.

- They are **built on packages like NumPy and matplotlib** to give you a convenient place to do data analysis and visualization work.

**<center><h2>That's All Folks!</h2></center>**